#ifndef WAPBROWSERAPP_H
#define WAPBROWSERAPP_H
//*==============================================================================
//           WapBrowserApp   A P P L E T  M O D U L E
// 文件:
//        WapBrowserApp.h
//        版权所有(c) 2011 Waterworld Tech. CO.,LTD.
//        
// 文件说明: 
//        
// 
//==============================================================================*/

/*==============================================================================
修改历史记录: 
时       间       修 改 人     修改内容、位置及原因
-----------      ----------    -----------------------------------------------

==============================================================================*/


/*==============================================================================
                             
                             本文件包含的外部文件
                             
==============================================================================*/
#include "AEE.h"              // Standard AEE Declarations
#include "AEEShell.h"         // AEE Shell Services

/*==============================================================================
                                 
                                 宏定义和常数
                                 
==============================================================================*/

/*==============================================================================
                                 
                                相关数据类型定义
                                 
==============================================================================*/
typedef struct _IWapBrowserApp  IWapBrowserApp;

QINTERFACE(IWapBrowserApp)
{
    INHERIT_IApplet(IWapBrowserApp);
    //Add yourself function pointer here
    //int (*Preview)(ITVApp *pi);
};

/*==============================================================================

                                 函数声明

==============================================================================*/
/*==============================================================================
函数: 
    IWapBrowserApp_AddRef

说明: 
    用于更新引用计数的Applet函数。

参数: 
    p [in/out]: IWapBrowserApp接口对象指针。

返回值: 
    当前对 WapBrowser Applet的引用数

备注:

==============================================================================*/
#define IWapBrowserApp_AddRef(p)                GET_PVTBL(p,IWapBrowserApp)->AddRef(p)

/*==============================================================================
函数: 
    IWapBrowserApp_Release

说明: 
    BREW用于释放资源的Applet函数。

参数: 
    p [in/out]: IWapBrowserApp接口对象指针。

返回值: 
    当前对 WapBrowser Applet的引用数

备注:

==============================================================================*/
#define IWapBrowserApp_Release(p)               GET_PVTBL(p,IWapBrowserApp)->Release(p)

/*==============================================================================
函数: 
    IWapBrowserApp_HandleEvent

说明: 
    由BREW调用的WapBrowser Applet事件处理主函数。

参数: 
    p [in/out]: IWapBrowserApp接口对象指针。
    ec [in]:  事件代码
    wp [in]:  事件特定数据
    dw [in]: 事件特定数据

返回值: 
    TRUE: 事件得到处理。
    FALSE: 没有处理事件。

备注:

==============================================================================*/
#define IWapBrowserApp_HandleEvent(p,ec,wp,dw) GET_PVTBL(p,IWapBrowserApp)->HandleEvent(p,  ec,  wp, dw)



#endif // end WapBrowserAPP_H


