#ifndef SCHEDULEAPP_H
#define SCHEDULEAPP_H

/*==============================================================================
// 文件：
//        ScheduleApp.h
//        2007-11-26 Gemsea草拟版本(Draft Version)
//        版权所有(c) 2007 Anylook
//        
// 文件说明：
//        
// 作者：2007-11-26
// 创建日期：
// 当前版本：Draft
==============================================================================*/

/*==============================================================================
修改历史记录：
时    间      修   改   人     修改内容、位置及原因
--------      -----------     -----------------------------------------------
==============================================================================*/


/*==============================================================================
                                 本文件包含的外部文件
==============================================================================*/


/*==============================================================================
                                 宏定义和常数
==============================================================================*/
/*==============================================================================
                                 类型定义
==============================================================================*/


/*==============================================================================
                                 类接口定义
==============================================================================*/
typedef struct _IScheduleApp  IScheduleApp;
 QINTERFACE(IScheduleApp)
{
    INHERIT_IApplet(IScheduleApp);
    
    void (*SportsPlan)(IScheduleApp *p);
    int (*DeleteAllEntry)(IScheduleApp *p);
};


/*==============================================================================
                                 类接口函数定义
==============================================================================*/
#define ISCHEDULEAPP_AddRef(p)                GET_PVTBL(p,IScheduleApp)->AddRef(p)
#define ISCHEDULEAPP_Release(p)               GET_PVTBL(p,IScheduleApp)->Release(p)
#define ISCHEDULEAPP_HandleEvent(p,ec,wp,dw)  GET_PVTBL(p,IScheduleApp)->HandleEvent(p, ec, wp, dw)
#define ISCHEDULEAPP_SportsPlan(p)         GET_PVTBL(p,IScheduleApp)->SportsPlan(p)
#define ISCHEDULEAPP_DeleleAllEntry(p)         GET_PVTBL(p,IScheduleApp)->DeleteAllEntry(p)

#endif //SCHEDULEAPP_H

