#ifndef CAMERAAPP_H
#define CAMERAAPP_H
//*==============================================================================
//           CameraApp   A P P L E T  M O D U L E
// 文件:
//        CameraApp.h
//        版权所有(c) 2009 Anylook Tech. CO.,LTD.
//        
// 文件说明: 
//        
// 
//==============================================================================*/

/*==============================================================================
修改历史记录: 
时       间       修 改 人     修改内容、位置及原因
-----------      ----------    -----------------------------------------------

==============================================================================*/


/*==============================================================================
                             
                             本文件包含的外部文件
                             
==============================================================================*/
#include "AEE.h"              // Standard AEE Declarations
#include "AEEShell.h"         // AEE Shell Services

/*==============================================================================
                                 
                                 宏定义和常数
                                 
==============================================================================*/

/*==============================================================================
                                 
                                相关数据类型定义
                                 
==============================================================================*/
typedef struct _ICameraApp  ICameraApp;

QINTERFACE(ICameraApp)
{
    INHERIT_IApplet(ICameraApp);
    //Add yourself function pointer here
    //int (*Preview)(ICameraApp *pi);
};

/*==============================================================================

                                 函数声明

==============================================================================*/
/*==============================================================================
函数: 
    ICameraApp_AddRef

说明: 
    用于更新引用计数的Applet函数。

参数: 
    p [in/out]: ICameraApp接口对象指针。

返回值: 
    当前对 Camera Applet的引用数

备注:

==============================================================================*/
#define ICameraApp_AddRef(p)                GET_PVTBL(p,ICameraApp)->AddRef(p)

/*==============================================================================
函数: 
    ICameraApp_Release

说明: 
    BREW用于释放资源的Applet函数。

参数: 
    p [in/out]: ICameraApp接口对象指针。

返回值: 
    当前对 Camera Applet的引用数

备注:

==============================================================================*/
#define ICameraApp_Release(p)               GET_PVTBL(p,ICameraApp)->Release(p)

/*==============================================================================
函数: 
    ICameraApp_HandleEvent

说明: 
    由BREW调用的Camera Applet事件处理主函数。

参数: 
    p [in/out]: ICameraApp接口对象指针。
    ec [in]:  事件代码
    wp [in]:  事件特定数据
    dw [in]: 事件特定数据

返回值: 
    TRUE: 事件得到处理。
    FALSE: 没有处理事件。

备注:

==============================================================================*/
#define ICameraApp_HandleEvent(p,ec,wp,dw) GET_PVTBL(p,ICameraApp)->HandleEvent(p,  ec,  wp, dw)

/*==============================================================================
接口: 
    ICameraApp_Preview

说明: 
    提供给外部Applet用来启动 CameraApp 开机初始化 Applet 结构数据的助手函数。

参数: 
    pi [in]: 指向ICameraApp接口t对象的指针。

返回值: 
    SUCCESS: Applet启动成功。
    EFAILED: Applet启动失败。

备注:
    该函数供外部程序调用，内部不得调用。
        
==============================================================================*/
//#define ICameraApp_Preview(p)         GET_PVTBL(p,ICameraApp)->Preview(p)

#endif // end CameraAPP_H

