#ifndef SOUNDMENU_H
#define SOUNDMENU_H

/*==============================================================================
// 文件：
//        SoundMenu.h
//        版权所有(c) 2009 Anylook Tech. CO.,LTD.
//
// 文件说明：
//
// 作者：Gemsea
// 创建日期：2007-11-01
// 当前版本：Draft
==============================================================================*/

/*==============================================================================
修改历史记录：
时       间      修 改 人    问题单号  修改内容、位置及原因
-----------      ----------  --------  -----------------------------------------
==============================================================================*/


/*==============================================================================
                                 本文件包含的外部文件
==============================================================================*/


/*==============================================================================
                                 宏定义和常数
==============================================================================*/


/*==============================================================================
                                 类型定义
==============================================================================*/


/*==============================================================================
                                 类接口定义
==============================================================================*/
typedef struct _ISoundMenu  ISoundMenu;
 QINTERFACE(ISoundMenu)
{
    INHERIT_IApplet(ISoundMenu);
    void (*SoundList)(ISoundMenu *p);
    void (*Autoanswer)(ISoundMenu *p);
    void (*Ringer_List)(ISoundMenu *p, void* t);
};


/*==============================================================================
                                 类接口函数定义
==============================================================================*/
#define ISoundMenu_AddRef(p)                GET_PVTBL(p,ISoundMenu)->AddRef(p)

#define ISoundMenu_Release(p)                GET_PVTBL(p,ISoundMenu)->Release(p)

#define ISoundMenu_HandleEvent(p,ec,wp,dw) \
GET_PVTBL(p,ISoundMenu)->HandleEvent(p, ec, wp, dw)

#define ISoundMenu_SoundList(p)    GET_PVTBL(p,ISoundMenu)->SoundList(p)

#define ISoundMenu_Autoanswer(p)   GET_PVTBL(p,ISoundMenu)->Autoanswer(p)

#define ISoundMenu_Ringer_List(p, t)  GET_PVTBL(p,ISoundMenu)->Ringer_List(p,t)
#endif
//SOUNDMENU_H

